# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\PSoC Creator\SAPI_DTR-1\DTR-1 v2 HW.cydsn\DTR-1 v2 HW.cyprj
# Date: Sun, 20 Jun 2021 14:53:38 GMT
#set_units -time ns
create_clock -name {Clk_1kHz(routed)} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 12.681159420289854 -waveform {0 6.34057971014493} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 12.681159420289854 -waveform {0 6.34057971014493} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 11 21} -nominal_period 126.81159420289853 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 87 173} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clk_24MHz} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 7} -nominal_period 41.666666666666664 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clk_1kHz} -source [get_pins {ClockBlock/clk_sync}] -edges {1 78859 157715} -nominal_period 1000000 [list [get_pins {ClockBlock/dclk_glb_3}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\PSoC Creator\SAPI_DTR-1\DTR-1 v2 HW.cydsn\TopDesign\TopDesign.cysch
# Project: C:\PSoC Creator\SAPI_DTR-1\DTR-1 v2 HW.cydsn\DTR-1 v2 HW.cyprj
# Date: Sun, 20 Jun 2021 14:53:28 GMT
